<?php
/* Template Name: Home Page */
get_header(); ?>
<!--Begin Hero Section-->


<header class="container mx-auto">
  <div class="header-bg-img">
    <div class="text-container">
      你在尋找專業的網頁設計？
      <p class="text-xl font-light mt-4">別讓你的網頁成為你的豬的隊友</p>
      <div class="flex justify-center mt-6">
        <a href="<?php echo esc_html(site_url("/wordpress-website")) ?>" class="btn teal-btn mr-4">我要網頁服務</a>
        <a href="<?php echo esc_html(site_url("/all-courses")) ?>" class="btn teal-outline-btn">我要學程式</a>
      </div>
    </div>
  </div>
</header>

<!-- 服務 -->
<section class="container mx-auto py-16">
  <h2 class="page-heading text-center mb-8">我們為您提供的服務</h2>
  <p class="text-center max-w-2xl mx-auto pb-12">
    以最專業的角度，從各方面分析網路用戶的習性及愛好，為您提供高品質數位行銷，增加網上知名度，使貴公司擁有最優質的競爭力！
  </p>
  <div class="flex flex-wrap -mx-3 sm:-mx-6">
    <div class="w-full sm:w-4/12 px-6">
      <div class="flex justify-center">
        <div class="svg-circle relative">
          <svg class="h-10 w-10 fill-current text-teal-500 inline-block mb-2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 424.629 424.629">
            <path d="M343 223.508l-54.6-52.6 29.5-70.3c2.1-5.1-.3-11-5.4-13.1-2.8-1.2-6-1-8.7.5l-66.1 36.2-56.3-50.5c-4.1-3.7-10.4-3.3-14.1.8-2 2.3-2.9 5.4-2.4 8.4l13.3 75.2-64.8 38.8c-4.7 2.8-6.3 9-3.4 13.7 1.6 2.6 4.2 4.4 7.2 4.8l39.3 5.4-148.1 148c-11.2 11.2-11.2 29.3 0 40.5s29.3 11.2 40.5.1l.1-.1 150.4-150.5 9 41.4c.9 4.2 4.4 7.3 8.6 7.8.4 0 .8.1 1.2.1 3.8 0 7.4-2.2 9-5.7l32.9-68.7 75 6.9c5.5.5 10.4-3.5 10.9-9 .3-3-.8-6-3-8.1zm-308.3 171.7c-3.4 3.4-8.8 3.4-12.2 0-3.4-3.4-3.4-8.8 0-12.2l52.2-52.2 12.2 12.2-52.2 52.2zm66.4-66.4l-12.2-12.2 92.4-92.4 10.8 1.5 2.2 9.9-93.2 93.2zm153.9-115.6c-4.2-.4-8.1 1.9-9.9 5.6l-23.3 48.7-11.5-52.9c-.9-4.1-4.3-7.2-8.4-7.8l-53.8-7.4 46.3-27.7c3.6-2.1 5.4-6.2 4.7-10.3l-9.4-53.5 40.1 35.9c3.2 2.8 7.8 3.4 11.5 1.3l47.2-25.9-21.1 50.2c-1.6 3.8-.7 8.2 2.3 11.1l39 37.6-53.7-4.9zM322.9 320.308l-27.9-40.7c-3-4.6-9.2-5.9-13.8-2.9-4.6 3-5.9 9.2-2.9 13.8.1.1.2.2.2.4l27.9 40.7c3.1 4.6 9.3 5.7 13.9 2.6s5.7-9.3 2.6-13.9zM247.4 6.908c-5.5 0-10 4.5-10 10v48.2c0 5.5 4.5 10 10 10s10-4.5 10-10v-48.2c0-5.5-4.5-10-10-10zM424.3 136.508c-1.4-5.2-6.7-8.4-11.9-7.2l-64.3 16.1c-5.4 1.2-8.7 6.6-7.5 12 1.2 5.4 6.6 8.7 12 7.5.1 0 .2-.1.3-.1l64.3-16.1c5.3-1.4 8.5-6.9 7.1-12.2zM115.4 123.208l-47.7-8c-5.5-.9-10.6 2.8-11.4 8.3-.9 5.4 2.7 10.5 8 11.5l47.7 8c.6.1 1.1.1 1.7.1 5.5 0 10-4.5 10-10 0-4.9-3.5-9-8.3-9.9z" />
          </svg>
        </div>
      </div>
      <h3 class="section-heading text-center mb-2 mt-4">網頁＆網頁系統 設計
      </h3>
      <p class="font-hairline w-10/12 mx-auto text-center">
        從公司Logo到購物車， 由小細節到整體頁面； 我們為您提供一條龍的服務，幫您全方位提升門面形象。
      </p>
    </div>
    <div class="w-full sm:w-4/12 px-6">
      <div class="flex justify-center">
        <div class="svg-circle relative">
          <!-- Brain -->
          <svg class="h-10 w-10 fill-current text-teal-500 inline-block mb-2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 480.852 480.852">
            <path d="M347.786 171.36v-2.08c-2.05-27.072-24.61-47.994-51.76-48-3.965.062-7.91.572-11.76 1.52-16.87-31.061-55.726-42.564-86.786-25.694a63.998 63.998 0 00-25.694 25.694 52.65 52.65 0 00-12-1.52c-28.701.044-51.956 23.299-52 52v4c-17.673 13.255-21.255 38.327-8 56a40 40 0 0032 16h58.48l22 58.8a8 8 0 007.52 5.2h48c40.529.041 74.591-30.435 79.04-70.72v-2.88a44.08 44.08 0 0016.96-34.4 43.998 43.998 0 00-16-33.92zm-122.48 125.92l-18-48h22.96l18 48h-22.96zm42.48 0h-2.48l-6-16h50.64a63.36 63.36 0 01-42.16 16zm55.12-32h-69.6l-6-16h72.48a44.757 44.757 0 009.84-1.12 66.367 66.367 0 01-6.72 17.12zm20.123-44.442a28 28 0 01-23.242 12.442h-76c-15.464 0-28-12.536-28-28s12.536-28 28-28v-16c-24.282.044-43.956 19.718-44 44a43.597 43.597 0 0010.08 28h-22.08c0-22.091-17.909-40-40-40v16c13.255 0 24 10.745 24 24h-40c-13.255 0-24-10.745-24-24s10.745-24 24-24v-16a39.95 39.95 0 00-8 .8c1.662-18.623 17.303-32.874 36-32.8a35.498 35.498 0 0112.96 2.4 36.389 36.389 0 0113.04 8.88 38.961 38.961 0 00-6 20.72h16c0-13.255 10.745-24 24-24v-16a40 40 0 00-23.2 7.52 52.406 52.406 0 00-9.92-8c13.675-22.71 43.171-30.035 65.881-16.36a48 48 0 0123.239 40.84h16a62.044 62.044 0 00-2-15.52 37.91 37.91 0 016-.48c19.851 0 35.956 16.069 36 35.92v2.16a7.999 7.999 0 003.52 6.64c12.857 8.592 16.314 25.98 7.722 38.838z" />
            <path d="M275.786 169.28v16c13.255 0 24 10.745 24 24h16c0-22.091-17.908-40-40-40zM461.066 33.28A30.96 30.96 0 01435.786 8a8 8 0 00-16 0 30.96 30.96 0 01-25.28 25.28 8 8 0 000 16 30.96 30.96 0 0125.28 25.28 8 8 0 0016 0 30.96 30.96 0 0125.28-25.28 8 8 0 000-16zm-33.28 19.44a45.757 45.757 0 00-11.44-11.44 45.757 45.757 0 0011.44-11.44 45.757 45.757 0 0011.44 11.44 45.774 45.774 0 00-11.44 11.44zM85.066 401.28A30.96 30.96 0 0159.786 376a8 8 0 00-16 0 30.96 30.96 0 01-25.28 25.28 8 8 0 00-6.72 8 8 8 0 006.72 8 30.96 30.96 0 0125.28 25.28 8 8 0 0016 0 30.96 30.96 0 0125.28-25.28 8 8 0 000-16zm-33.28 19.44a45.757 45.757 0 00-11.44-11.44 45.757 45.757 0 0011.44-11.44 45.757 45.757 0 0011.44 11.44 45.774 45.774 0 00-11.44 11.44zM384.826 297.28c-2.72 4.32-5.52 8.56-8.56 12.72l12.88 9.44c3.28-4.48 6.64-9.12 9.28-14.16l-13.6-8zM366.666 322c-3.28 3.76-6.88 7.52-10.56 11.12l11.2 11.44c4-3.84 7.84-7.92 11.44-12.08L366.666 322zM420.106 145.36l-15.68 4.24c1.44 4.96 2.64 9.92 3.68 14.88l16-3.12c-1.12-5.44-2.4-10.88-4-16zM398.586 269.92c-1.92 4.64-4 9.36-6.32 14l14.32 7.12c2.48-4.96 5.2-9.76 6.8-15.2l-14.8-5.92zM344.026 38.48l-9.28 13.04c4.16 2.96 8 6.16 12.08 9.44l10.32-12.24c-4.16-3.52-8.56-6.96-13.12-10.24zM390.426 85.6l-12.64 9.12c2.96 4.16 5.84 8.48 8 12.88l13.76-8c-2.8-4.8-5.84-9.44-9.12-14zM369.386 60.08l-11.36 11.28c3.68 3.6 7.12 7.36 10.4 11.28l12.24-10.32c-3.52-4.24-7.36-8-11.28-12.24zM407.866 114l-14.4 7.28c2.16 4.64 4.24 9.36 6.08 14.08l14.88-6.08c-1.92-5.12-4.16-10.32-6.56-15.28zM407.226 240.64c-1.04 4.96-2.4 10-3.84 14.8l15.28 4.72c1.92-5.28 3.36-10.88 4.56-16.16l-16-3.36zM426.426 177.76l-16 1.84c.64 5.04.96 10.24 1.2 15.36l16-.56c.16-5.6-.56-11.12-1.2-16.64zM411.786 210.24c0 5.12-.72 10.24-1.36 15.28l16 2.08c.32-5.44.88-11.04 1.36-16.56l-16-.8zM43.786 212l-16 .96c0 5.52.88 11.12 1.68 16.56l16-2.24c-.56-5.04-1.04-10-1.68-15.28zM315.786 21.44l-6.96 14.4c4.56 2.24 9.12 4.72 13.44 7.28l8-13.76c-4.88-2.8-9.84-5.44-14.48-7.92zM48.346 242.48l-15.6 3.6c1.28 5.36 2.72 10.8 4.4 16l15.28-4.8c-1.6-4.88-2.88-9.84-4.08-14.8zM28.746 179.36c-.4 5.92-.96 11.36-.96 16.96h16c0-5.04.4-10.24.96-15.28l-16-1.68zM71.706 298.72l-13.6 8.48c2.88 4.64 6.08 9.28 9.44 13.76l12.8-9.6c-3.04-4.08-6-8-8.64-12.64zM35.466 146.96c-1.68 5.36-3.04 10.8-4.08 16.24l16 3.04c.96-5.04 2.16-10 3.52-14.96l-15.44-4.32zM90.026 323.28l-12 10.56c3.68 4.16 8 8 11.6 12l11.04-11.52c-3.68-3.52-7.28-7.28-10.64-11.04zM46.906 115.84c-2.4 5.44-4.56 10.16-6.48 15.28l14.96 5.68c1.867-4.8 3.867-9.52 6-14.16l-14.48-6.8zM112.186 344.08l-10.08 12.8c4.24 3.44 8.8 6.8 13.36 9.92l8.96-13.52c-4.16-2.88-8-6-12.24-9.2zM137.466 361.6l-7.84 14c4.8 2.64 9.76 5.2 14.88 7.52l6.64-14.48c-4.64-2.16-9.2-4.48-13.68-7.04zM319.546 360.56c-4.4 2.48-8.96 4.88-13.6 7.12l6.88 14.72c5.04-2.4 10-5.04 14.72-8l-8-13.84zM57.626 271.52l-14.72 6.08c2.08 5.12 4.4 10.24 6.96 15.12l14.24-7.28a237.144 237.144 0 01-6.48-13.92zM63.386 86.96c-2.96 4.56-5.92 9.36-8.72 14.08l13.84 8c2.56-4.32 5.36-8.72 8-12.88l-13.12-9.2zM84.906 61.36c-3.92 4-8 8-11.2 12.4l12.32 10.16c3.28-3.84 6.72-7.68 10.32-11.36l-11.44-11.2zM110.026 39.6c-4.48 3.28-8.8 6.72-13.04 10.32l10.8 12.16c3.84-3.36 8-6.56 12-9.6l-9.76-12.88zM201.946 2.96a164.949 164.949 0 00-16.48 2.8l3.44 15.6c4.96-1.04 10-1.92 15.04-2.56l-2-15.84zM169.386 9.92c-5.28 1.6-10.56 3.52-16 5.52l6 14.88c4.72-1.84 9.6-3.6 14.4-5.04l-4.4-15.36zM218.506 1.28l.72 16h15.36l.56-16h-16.64zM284.346 9.28l-4.48 15.28c4.88 1.52 9.76 3.12 14.48 4.96l5.44-14.72c-4.8-2-10.08-3.84-15.44-5.52zM251.786 2.72l-1.92 16c5.04.64 10.08 1.44 15.12 2.48l3.2-16c-5.44-.96-10.96-1.84-16.4-2.48zM138.426 22.24c-4.88 2.48-9.76 5.2-14.56 8l8 13.68a182.654 182.654 0 0113.44-7.44l-6.88-14.24zM344.746 343.36c-3.92 3.2-8 6.32-12.24 9.2l9.12 13.2c4.56-3.2 9.04-6.56 13.28-10.08l-10.16-12.32z" />
            <path d="M362.499 114.996A160.037 160.037 0 00334.426 82C268.81 22.814 167.638 28.027 108.452 93.643s-53.973 166.788 11.643 225.974a160.025 160.025 0 0021.212 16.143 49.04 49.04 0 0122.48 41.52v40c.019 14.853 10.256 27.741 24.72 31.12 4.173 21.694 25.141 35.897 46.835 31.725a40.001 40.001 0 0031.725-31.725c14.464-3.379 24.701-16.267 24.72-31.12v-40a48.72 48.72 0 0122.16-41.28c74.435-47.621 96.173-146.568 48.552-221.004zM227.786 465.28a24.002 24.002 0 01-22.64-16h45.28a24 24 0 01-22.64 16zm32-32h-64c-8.837 0-16-7.163-16-16h96c0 8.837-7.163 16-16 16zm16-32h-96v-16h96v16zm59.241-104.024a143.968 143.968 0 01-29.641 25.224h-.08a64 64 0 00-29.04 46.8h-16.48v-40h-16v40h-32v-48h-16v48h-16.48a64.721 64.721 0 00-29.36-46.96c-66.823-43.123-86.035-132.252-42.912-199.074A144.002 144.002 0 01211.146 58.32a149.03 149.03 0 0116.64-1.04 142.236 142.236 0 0196 36.64c59.254 53.046 64.287 144.083 11.241 203.336z" />
          </svg>
        </div>
      </div>
      <h3 class="section-heading text-center mb-2 mt-4">SEO 優化</h3>
      <p class="font-hairline w-10/12 mx-auto text-center">
        讓客戶第一眼就找到您！幫助提高網頁搜索的排名，讓您的公司價值更進一步。
      </p>
    </div>
    <div class="w-full sm:w-4/12 px-6">
      <div class="flex justify-center">
        <div class="svg-circle relative">
          <svg class="h-10 w-10 fill-current text-teal-500 inline-block mb-2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 434.407 434.407">
            <g>
              <path d="M190.062 62.864a10.972 10.972 0 00-14.629 0 10.971 10.971 0 000 15.151l11.494 11.494-135.314 208.98-40.751 40.751c-4.04 3.706-4.31 9.986-.603 14.025a9.8 9.8 0 00.603.603l77.322 77.322c3.706 4.04 9.986 4.31 14.025.603a9.8 9.8 0 00.603-.603l41.273-40.751 31.869-20.376 44.408 44.408c3.706 4.04 9.986 4.31 14.025.603a9.8 9.8 0 00.603-.603l80.457-80.457a10.45 10.45 0 003.135-7.314 10.447 10.447 0 00-3.135-7.837l-24.033-24.033 61.127-39.184 11.494 11.494a13.06 13.06 0 007.837 2.612 12.54 12.54 0 007.314-2.612 12.016 12.016 0 000-15.151L190.062 62.864zM95.499 409.248l-62.694-62.694 27.167-27.167 62.694 62.694-27.167 27.167zm198.008-82.547l-65.829 65.306-33.959-33.959 79.935-51.2 19.853 19.853zm-154.645 41.796l-65.306-65.306L202.078 104.66l135.314 135.837-198.53 128zM301.866 127.126c2.055 2.1 4.9 3.238 7.837 3.135a10.446 10.446 0 007.314-3.135l59.037-59.037a10.971 10.971 0 000-15.151c-3.706-4.04-9.986-4.31-14.025-.603a9.8 9.8 0 00-.603.603l-59.559 59.037a12.015 12.015 0 00-.001 15.151zM268.429 91.077h3.657a10.972 10.972 0 009.927-6.792l26.122-70.008A10.972 10.972 0 00301.866.693c-5.39-2.063-11.431.635-13.493 6.024a10.22 10.22 0 00-.09.245l-25.6 70.531c-2.153 5.338.416 11.411 5.746 13.584zM426.209 125.558c-1.927-5.44-7.899-8.287-13.339-6.36a10.22 10.22 0 00-.245.09l-70.008 26.122c-5.229 1.648-8.132 7.223-6.484 12.451.065.206.136.409.214.61a10.448 10.448 0 009.927 7.314l3.657-1.045 70.008-25.6a10.968 10.968 0 006.27-13.582z" />
            </g>
          </svg>
        </div>
      </div>
      <h3 class="section-heading text-center mb-2 mt-4">數位行銷</h3>
      <p class="font-hairline w-10/12 mx-auto text-center">
        使用FB, Google
        廣告等數位媒體，將您的服務、產品或廣告清晰、簡潔且高頻率的呈現給各個網路用戶。
      </p>
    </div>
  </div>
</section>
<!-- 為什麼選我們？ -->
<section class="py-16 bg-gray-100">
  <div class="container mx-auto">
    <div class="flex flex-wrap -mx-3 sm:-mx-6">
      <div class="w-full md:w-5/12 px-6">
        <h2 class="page-heading mb-8">為什麼選我們？</h2>
        <p class="pb-8 font-hairline">
          我們擁有網頁工程師的背景，對於程式品質具有極高的自我要求。在電子商務及數位行銷上更有著豐富的經驗。
        </p>
        <p class="font-hairline">
          我們有能力為您提供從網頁設計到數位行銷的高品質一條龍服務，讓貴公司輕鬆擁有最佳的網上競爭力並能大幅度提升公司商業價值！
        </p>
      </div>
      <div class="w-full md:w-7/12 px-2">
        <div class="flex flex-wrap sm:-mx-6">
          <div class="w-full md:w-6/12 px-6 mb-4">
            <?php get_template_part('template-parts/content', 'svg-webapp'); ?>
            <h3 class="section-heading my-6">響應式網頁</h3>
            <p class="font-hairline">
              幫您架設能用於手機、平板或電腦等數位商品的網頁。讓客戶隨時隨地都能掌握貴公司的最新動態。
            </p>
          </div>
          <div class="w-full md:w-6/12 px-6 mb-4">
            <?php get_template_part('template-parts/content', 'svg-ecommerce'); ?>
            <h3 class="section-heading my-6">電子商務</h3>
            <p class="font-hairline">
              串金流，客製化產品頁面，和多項收款表單。讓您以最簡單的方式完成商業動作及後台資料整合
            </p>
          </div>
          <div class="w-full md:w-6/12 px-6 mb-4 mt-4">
            <?php get_template_part('template-parts/content', 'svg-responsive'); ?>
            <h3 class="section-heading my-6">網頁應用系統</h3>
            <p class="font-hairline">
              網站架設其實是由許多不同部分的設計及多種程式語言組合而成。從好看的UI美學，到複雜邏輯的後端開發，我們都有著豐富的業界經驗。
            </p>
          </div>
          <div class="w-full md:w-6/12 px-6 mb-4 mt-4">
            <?php get_template_part('template-parts/content', 'svg-chat'); ?>
            <h3 class="section-heading my-6">客戶溝通</h3>
            <p class="font-hairline">
              我們用心傾聽每位客戶的想法及意見，並以最專業的態度，認真、耐心的幫您完成您交予我們的託付。
            </p>
          </div>
        </div>
      </div>
    </div>
  </div>
</section>

<!-- 服務 -->
<section class="container mx-auto py-16">
  <h2 class="page-heading text-center mb-8">最新作品</h2>
  <p class="text-center max-w-2xl mx-auto pb-12">
    獨一無二的作品，獻給擁有偉大夢想的您
  </p>
  <div class="flex flex-wrap sm:-mx-2">
    <?php
    $args = array(
      'post_type' => array('optimization', 'project'),
      'posts_per_page' => 3,
    );
    $project_query = new WP_Query($args);
    while ($project_query->have_posts()) : $project_query->the_post();
    ?>
      <div class="w-full sm:w-4/12 px-2">
        <a href="<?php the_permalink(); ?>" class="card">
          <div class="relative">
            <?php if (has_post_thumbnail()) {
              the_post_thumbnail('medium', array('class'  => 'ih-64 object-cover object-center w-full'));
            } else {
            ?>
              <img src="<?php bloginfo('template_directory'); ?>/assets/images/blog/blog1.jpg" alt="">
            <?php
            } ?>
          </div>
          <!-- Card Img-->
          <div class="card-content p-2">
            <h3 class="font-medium text-center"><?php the_title(); ?></h3>
            <div class="flex justify-center items-center my-2">
              <svg class="mt-1 h-4 w-4 fill-current text-teal-500" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20">
                <path d="M2 2c0-1.1.9-2 2-2h12a2 2 0 0 1 2 2v18l-8-4-8 4V2zm2 0v15l6-3 6 3V2H4z" /></svg>
              <span class="text-gray-500 ml-2"><?php echo get_post_type_object(get_post_type())->label; ?></span>
            </div>
          </div>
        </a>
      </div>
    <?php endwhile; ?>
    <!-- w-1/3 -->
  </div>
</section>


<!-- 文章 -->
<section class="py-16 bg-gray-100">
  <div class="container mx-auto">
    <h2 class="page-heading text-center mb-8">最新文章</h2>
    <p class="text-center max-w-2xl mx-auto pb-12">
      這裡有許多訊息想分享給您，希望您能在其中找到與我們相同的樂趣。
    </p>
    <div class="flex flex-wrap sm:-mx-2">
      <?php
      $args = array(
        'cat' => '1',
        'posts_per_page' => 3,
      );

      $query = new WP_Query($args);

      while ($query->have_posts()) : $query->the_post(); ?>
        <div class="w-full sm:w-4/12 px-2">
          <div class="card block w-full">
            <div class="relative"><a href="<?php the_permalink(); ?>">
                <?php if (has_post_thumbnail()) {
                  the_post_thumbnail('medium', array('class'  => 'h-64 object-cover object-center w-full'));
                } else {
                ?>
                  <img src="<?php bloginfo('template_directory'); ?>/assets/images/blog/blog1.jpg" alt="">
                <?php
                } ?>
                <div class="date ">
                  <span><?php echo get_the_date('F'); ?></span>
                  <div class="mt-1"><?php echo get_the_date('j'); ?></div>
                </div>
              </a>
            </div>
            <!-- Card Img-->
            <div class="card-content p-4">
              <h3 class="font-medium"><a href="<?php the_permalink(); ?>"><?php the_title(); ?></a></h3>
              <div class="flex items-center my-2">
                <svg class="mt-1 h-4 w-4 fill-current text-teal-500" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20">
                  <path d="M2 2c0-1.1.9-2 2-2h12a2 2 0 0 1 2 2v18l-8-4-8 4V2zm2 0v15l6-3 6 3V2H4z" /></svg>
                <span class="text-gray-600 ml-2"><?php incomplete_cat_list(', '); ?></span>
              </div>
              <p class="font-hairline">
                <?php echo excerpt(30) ?><a <a href="<?php the_permalink(); ?>" class="text-sm text-teal-500">...繼續閱讀</a>
              </p>
            </div>
          </div>
        </div>
        <!-- w-4/12 -->
      <?php endwhile;
      wp_reset_query(); ?>
    </div>
  </div>
</section>

<!--End sponsors clients-->
<?php
get_footer();
